<template>
    <Layout>
        <header>
          <div class="container tzentr">
              <h1 class="headus">Подробнее</h1>
          </div>
        </header>
        <section class="section aboutfoss">
            <div class="container">
              <h3>Что такое исходный код?</h3>
              <h5>Исходный код - это набор инструкций, которые сообщают электронным устройствам, как запускать приложения, составляющие цифровой мир, включая операционные системы, текстовые процессоры, браузеры, видеоигры, смартфоны и веб-сайты. Миллионы компьютеров используют один и тот же код, а это значит, что он должен быть надежным и обеспечивать стабильные результаты.</h5>
            </div>
            <div class="container">
                <h3>Что такое закрытый источник кода?</h3>
                <h5>Хороший код - и хорошие приложения - имеют огромное значение. Многие компании держат свой код в секрете, пытаясь контролировать и получать прибыль от распространения своей продукции. Их собственный исходный код закрыт от посторонних, которые не могут проверить код или выяснить, как он работает.</h5>
            </div>
            <div class="container">
                <h3>Что такое открытый исходный код?</h3>
                <h5>С другой стороны, открытый исходный код общедоступен для просмотра, изучения, использования, изменения и распространения. Инициатива Open Source разработала точное определение программного обеспечения с открытым исходным кодом. Лицензия с открытым исходным кодом предотвращает ограничения на использование программного обеспечения - от коммерческого распространения до того, кто может использовать программное обеспечение и для каких целей. Он подчеркивает нейтральность, доступность и свободу.</h5>
            </div>
            <div class="container">
                <h3>Программное обеспечение с открытым исходным кодом в мире</h3>
                <h5>Разработка с открытым исходным кодом способствует стабильности, безопасности и инновациям. Открывая код для широкого изучения, все больше людей принимают участие в поиске его ошибок и недостатков безопасности, в тестировании на широкую совместимость между платформами и в предоставлении новых идей. Когда серьезная проблема обнаружена, широкое сообщество разработчиков работает вместе, чтобы решить ее, включая и наших инженеров в ОСПО.</h5>
                <h5>Путь разроботки с открытым исходным кодом настолько эффективен, что привлекает огромный технический талант. Большая часть инноваций в технологиях происходит в сообществе открытого исходного кода, и люди во всем мире используют программное обеспечение с открытым исходным кодом. За многими популярными веб-сайтами и приложениями вы можете найти проекты, такие как Linux®, NGINX и Git, и люди получают доступ к Интернету с помощью браузеров с открытым исходным кодом, таких как Firefox и Chromium.</h5>
            </div>
            <div class="container">
                <h3>Что такое исходный код?</h3>
              <h5>Исходный код - это набор инструкций, которые сообщают электронным устройствам, как запускать приложения, составляющие цифровой мир, включая операционные системы, текстовые процессоры, браузеры, видеоигры, смартфоны и веб-сайты. Миллионы компьютеров используют один и тот же код, а это значит, что он должен быть надежным и обеспечивать стабильные результаты.</h5>
            </div>
            
        </section>
        <section class="distributions">

        </section>
        <section class="offices">

        </section>
        <section class="webdev">

        </section>
    </Layout>
</template>

<script>
export default {
     metaInfo: {
     title: 'Подробнее'
  }

}
</script>

<style scoped>
.tzentr {
    text-align: center;
}
.headus {
    padding-top: 3rem;
}


</style>
